layer {
  name: "data"
  type: "DriveData"
  top: "data"
  top: "label"
  top: "label_type"
  include:{ phase: TRAIN }
  transform_param {
    mean_file: "./../../data/lmdb/train_mean.binaryproto"
  }
  data_param {
    source: "./../../data/lmdb/train/"
    batch_size: 20
    backend: LMDB
  }
  drive_data_param {
    shrink_prob_factor: 1
    unrecognize_factor: 0.4
    crop_num: 2
    random_crop_ratio: 0.1
    resize: -1
    scale: 1
    cropped_height: 480
    cropped_width: 640
    tiling_width: 20
    tiling_height: 15
    label_resolution: 8
    catalog_resolution: 2
    catalog_number: 250
    resize_max: 5
    resize_min: 0.2
    reco_max: 170
    reco_min: 32
    train_max: 200
    train_min: 10
    genlist_file: "./../../data/marks/genlist.txt"
    gen_rate: 1
    blur_max: 10
    noise_max: 0.1
    gamma_max: 0.69314718056
    k_max: 0.1
    y0_max: 0.1
    shrink_max: 0.5
    slip_max: 0.2
    gen_scale: 1
    use_mask: false
  }
}
layer {
  name: "data"
  type: "DriveData"
  top: "data"
  top: "label"
  top: "label_type"
  include:{ phase: TEST }
  transform_param {
    mean_file: "./../../data/lmdb/train_mean.binaryproto"
  }
  data_param {
    source: "./../../data/lmdb/test/"
    batch_size: 1
    backend: LMDB
  }
  drive_data_param {
    shrink_prob_factor: 1
    unrecognize_factor: 0.4
    crop_num: 2
    random_crop_ratio: 0.1
    resize: -1
    scale: 1
    cropped_height: 480
    cropped_width: 640
    tiling_width: 20
    tiling_height: 15
    label_resolution: 8
    catalog_resolution: 2
    catalog_number: 250
    resize_max: 5
    resize_min: 0.2
    reco_max: 170
    reco_min: 32
    train_max: 200
    train_min: 10
    genlist_file: "./../../data/marks/genlist.txt"
    gen_rate: 1
    blur_max: 10
    noise_max: 0.1
    gamma_max: 0.69314718056
    k_max: 0.1
    y0_max: 0.1
    shrink_max: 0.5
    slip_max: 0.2
    gen_scale: 1
    use_mask: false
  }
}
layer {
  name: "label_pixel"
  type: "Slice"
  bottom: "label"
  top: "label_pixel"
  top: "label_bb"
  top: "label_size"
  top: "label_norm"
  slice_param {
    slice_dim: 1
    slice_point: 1
    slice_point: 5
    slice_point: 7
  }
}
layer {
  name: "label_pixel4"
  type: "Concat"
  bottom: "label_pixel"
  bottom: "label_pixel"
  bottom: "label_pixel"
  bottom: "label_pixel"
  top: "label_pixel4"
  concat_param {
    concat_dim: 1
  }
}
layer {
  name: "label_size4"
  type: "Concat"
  bottom: "label_size"
  bottom: "label_size"
  top: "label_size4"
  concat_param {
    concat_dim: 1
  }
}
layer {
  name: "label_norm4"
  type: "Concat"
  bottom: "label_norm"
  bottom: "label_norm"
  bottom: "label_norm"
  bottom: "label_norm"
  top: "label_norm4"
  concat_param {
    concat_dim: 1
  }
}
layer {
  name: "label_bb_sn"
  type: "Eltwise"
  bottom: "label_bb"
  bottom: "label_size4"
  top: "label_bb_sn"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "label_bb_sn_nn"
  type: "Eltwise"
  bottom: "label_bb_sn"
  bottom: "label_norm4"
  top: "label_bb_sn_nn"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Convolution1"
  type: "Convolution"
  bottom: "data"
  top: "Convolution1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1.0
    }
  }
}
layer {
  name: "conv0"
  type: "ReLU"
  bottom: "Convolution1"
  top: "Convolution1"
}
layer {
  name: "norm0"
  type: "LRN"
  bottom: "Convolution1"
  top: "norm0"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  name: "pool0"
  type: "Pooling"
  bottom: "norm0"
  top: "pool0"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "Convolution2"
  type: "Convolution"
  bottom: "pool0"
  top: "Convolution2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1.0
    }
  }
}
layer {
  name: "conv1"
  type: "ReLU"
  bottom: "Convolution2"
  top: "Convolution2"
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "Convolution2"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 8
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "norm1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "Convolution3"
  type: "Convolution"
  bottom: "pool1"
  top: "Convolution3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv2"
  type: "ReLU"
  bottom: "Convolution3"
  top: "Convolution3"
}
layer {
  name: "Convolution4"
  type: "Convolution"
  bottom: "Convolution3"
  top: "Convolution4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv3"
  type: "ReLU"
  bottom: "Convolution4"
  top: "Convolution4"
}
layer {
  name: "Convolution5"
  type: "Convolution"
  bottom: "Convolution4"
  top: "Convolution5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4"
  type: "ReLU"
  bottom: "Convolution5"
  top: "Convolution5"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "Convolution5"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "Convolution6"
  type: "Convolution"
  bottom: "pool4"
  top: "Convolution6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 4096
    pad: 3
    kernel_size: 6
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1.0
    }
  }
}
layer {
  name: "fc5"
  type: "ReLU"
  bottom: "Convolution6"
  top: "Convolution6"
}
layer {
  name: "drop5"
  type: "Dropout"
  bottom: "Convolution6"
  top: "Convolution6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "Convolution7"
  type: "Convolution"
  bottom: "Convolution6"
  top: "Convolution7"
  param {
    lr_mult: 5
    decay_mult: 0.1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 4096
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1.0
    }
  }
}
layer {
  name: "fc6"
  type: "ReLU"
  bottom: "Convolution7"
  top: "Convolution7"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "Convolution7"
  top: "Convolution7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "Convolution8"
  type: "Convolution"
  bottom: "Convolution6"
  top: "Convolution8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 4096
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1.0
    }
  }
}
layer {
  name: "ReLU1"
  type: "ReLU"
  bottom: "Convolution8"
  top: "Convolution8"
}
layer {
  name: "Dropout1"
  type: "Dropout"
  bottom: "Convolution8"
  top: "Convolution8"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "Convolution9"
  type: "Convolution"
  bottom: "Convolution8"
  top: "Convolution9"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "output_pixel"
  type: "Tiling"
  bottom: "Convolution9"
  top: "output_pixel"
  tiling_param {
    tile_dim: 8
  }
}
layer {
  name: "loss_pixel"
  type: "SoftmaxWithLoss"
  bottom: "output_pixel"
  bottom: "label_pixel"
  top: "loss_pixel"
  loss_weight: 1
}
layer {
  name: "acc_pixel_all"
  type: "Accuracy"
  bottom: "output_pixel"
  bottom: "label_pixel"
  top: "acc_pixel_all"
}
layer {
  name: "acc_pixel_top1"
  type: "Accuracy"
  bottom: "output_pixel"
  bottom: "label_pixel"
  top: "acc_pixel_top1"
  accuracy_param {
    ignore_label: 0
  }
}
layer {
  name: "Convolution10"
  type: "Convolution"
  bottom: "Convolution6"
  top: "Convolution10"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 4096
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1.0
    }
  }
}
layer {
  name: "ReLU2"
  type: "ReLU"
  bottom: "Convolution10"
  top: "Convolution10"
}
layer {
  name: "Dropout2"
  type: "Dropout"
  bottom: "Convolution10"
  top: "Convolution10"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "Convolution11"
  type: "Convolution"
  bottom: "Convolution10"
  top: "Convolution11"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1004
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "output_type"
  type: "Tiling"
  bottom: "Convolution11"
  top: "output_type"
  tiling_param {
    tile_dim: 2
  }
}
layer {
  name: "loss_type"
  type: "SoftmaxWithLoss"
  bottom: "output_type"
  bottom: "label_type"
  top: "loss_type"
  loss_weight: 3
}
layer {
  name: "acc_type_all"
  type: "Accuracy"
  bottom: "output_type"
  bottom: "label_type"
  top: "acc_type_all"
}
layer {
  name: "acc_type_top1"
  type: "Accuracy"
  bottom: "output_type"
  bottom: "label_type"
  top: "acc_type_top1"
  accuracy_param {
    ignore_label: 0
  }
}
layer {
  name: "acc_type_top5"
  type: "Accuracy"
  bottom: "output_type"
  bottom: "label_type"
  top: "acc_type_top5"
  accuracy_param {
    top_k: 5
    ignore_label: 0
  }
}
layer {
  name: "Convolution12"
  type: "Convolution"
  bottom: "Convolution7"
  top: "Convolution12"
  param {
    lr_mult: 20
    decay_mult: 0.1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "output_bb"
  type: "Tiling"
  bottom: "Convolution12"
  top: "output_bb"
  tiling_param {
    tile_dim: 8
  }
}
layer {
  name: "Eltwise1"
  type: "Eltwise"
  bottom: "output_bb"
  bottom: "label_pixel4"
  top: "Eltwise1"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Eltwise2"
  type: "Eltwise"
  bottom: "Eltwise1"
  bottom: "label_size4"
  top: "Eltwise2"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "output_bb_norm"
  type: "Eltwise"
  bottom: "Eltwise2"
  bottom: "label_norm4"
  top: "output_bb_norm"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "loss_bb"
  type: "L1Loss"
  bottom: "output_bb_norm"
  bottom: "label_bb_sn_nn"
  top: "loss_bb"
  loss_weight: 3.0
}
